# installing my package

In [2]:
!pip install dataprocessingml  # run this cell two times so the output

Requirement already satisfied: dataprocessingml in c:\users\sumit kumar sahoo\anaconda3\lib\site-packages (0.1)

# creating alias for my package

In [3]:
import dataprocessingml as sks

# Testing my package

In [5]:
# importing pandas as pd
import pandas as pd
  
# importing numpy as np
import numpy as np
  
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score':[30, 45, 50,np.nan],
        'Third Score':[np.nan,40, 98, 98]}
  
# creating a dataframe from dictionary
df = pd.DataFrame(dict)

In [12]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          50.0         98.0
3         95.0           NaN         98.0

# Here "sks" is the alias name of the package.

# "check" is the class in that package.

# "a" is the object to class check

In [14]:
a = sks.check(df)

# In the below cells I tested all the function present within that package

In [15]:
a.isnull(df) # here we can see there is null value presnt in each column

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [16]:
a.fillna(df) # here we are filling the nu

First Score has null value
what you want to replace float or mean or median or mode(give one choice out of 4):float
Enter number as per your choice:0
Second Score has null value
what you want to replace float or mean or median or mode(give one choice out of 4):mode
Third Score has null value
what you want to replace float or mean or median or mode(give one choice out of 4):mean

In [17]:
df

   First Score  Second Score  Third Score
0        100.0          30.0    78.666667
1         90.0          45.0    40.000000
2          0.0          50.0    98.000000
3         95.0          30.0    98.000000

In [18]:
x=df[['First Score','Second Score']]

In [19]:
a.standard(x)

array([[ 0.69633057, -0.98019606],
       [ 0.45412863,  0.70014004],
       [-1.7256888 ,  1.26025208],
       [ 0.5752296 , -0.98019606]])

In [6]:
df1 = pd.read_csv('Admission_Prediction.csv')

In [9]:
b = sks.check(df1)

In [10]:
b.isnull(df1)

Serial No.            0
GRE Score            15
TOEFL Score          10
University Rating    15
SOP                   0
LOR                   0
CGPA                  0
Research              0
Chance of Admit       0
dtype: int64

In [11]:
b.fillna(df1)

GRE Score has null value
what you want to replace float or mean or median or mode(give one choice out of 4):mean
TOEFL Score has null value
what you want to replace float or mean or median or mode(give one choice out of 4):mode
University Rating has null value
what you want to replace float or mean or median or mode(give one choice out of 4):mode

In [12]:
df1

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337.000000,118.0,4.0,4.5,4.5,9.65,1,0.92
1,2,324.000000,107.0,4.0,4.0,4.5,8.87,1,0.76
2,3,316.558763,104.0,3.0,3.0,3.5,8.00,1,0.72
3,4,322.000000,110.0,3.0,3.5,2.5,8.67,1,0.80
4,5,314.000000,103.0,2.0,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...,...
495,496,332.000000,108.0,5.0,4.5,4.0,9.02,1,0.87
496,497,337.000000,117.0,5.0,5.0,5.0,9.87,1,0.96
497,498,330.000000,120.0,5.0,4.5,5.0,9.56,1,0.93
498,499,312.000000,103.0,4.0,4.0,5.0,8.43,0,0.73
499,500,327.000000,113.0,4.0,4.5,4.5,9.04,0,0.84